package main

import (
	"fmt"
	"sync"
)

// Використовуючи горутини, напишіть програму, що реалізує завдання для філософів, що обідають: «За круглим столом розставлено п'ять стільців, на кожному з яких сидить філософ. У центрі столу розміщена страва з макаронами. На столі лежать п'ять виделок, кожна з яких знаходиться між двома сусідніми тарілками. Кожен філософ може перебувати у двох станах: розмірковувати чи їсти макарони. Для того, щоб почати їсти, філософу необхідні дві виделки: одна в правій руці, а друга в лівій. Закінчивши трапезу, філософ кладе виделки на місце і починає розмірковувати доти, доки знову не зголодніє".

func task3DiningPhilosophers() {
	const n = 5
	const meals = 3

	forks := make([]sync.Mutex, n)
	var wg sync.WaitGroup
	wg.Add(n)

	for i := 0; i < n; i++ {
		left := i
		right := (i + 1) % n

		// один філософ бере виделки в іншому порядку.
		if i == 0 {
			left, right = right, left
		}

		go func(id, left, right int) {
			defer wg.Done()
			for m := 0; m < meals; m++ {
				fmt.Printf("Філософ %d розмірковує\n", id+1)

				forks[left].Lock()
				forks[right].Lock()

				fmt.Printf("Філософ %d їсть\n", id+1)

				forks[right].Unlock()
				forks[left].Unlock()
			}
		}(i, left, right)
	}

	wg.Wait()
}
